DATAFRAME CON PANDAS

data = Diccionario
<br>
index = filas
<br>
colummns = columas

In [1]:
import pandas as pd

Dataframe  a partir de un diccionario

In [2]:
data = {'ALUMNO':['Selene', 'Joseep', 'Marck'],
        'CURSO':['Matemática', 'Lenguaje', 'Ciencia Sociales'],
        'CREDITOS':[4, 5, 6]}

In [3]:
alumnos = pd.DataFrame(data)
alumnos

   ALUMNO             CURSO  CREDITOS
0  Selene        Matemática         4
1  Joseep          Lenguaje         5
2   Marck  Ciencia Sociales         6

DataFrame con una lista

In [6]:
df = pd.DataFrame([["Maria", 15], ["Selene", 17], ["Rony", 37]], columns=["NOMBRE", "EDAD"])
df

   NOMBRE  EDAD
0   Maria    15
1  Selene    17
2    Rony    37

DataFrame con array numpy

In [7]:
import pandas as pd
import numpy as np

In [9]:
df = pd.DataFrame(np.random.randn(4, 3), columns=["N1", "N2", "N3"])
df

         N1        N2        N3
0  0.594315  0.182587  1.727598
1  1.305548  1.106087 -0.202342
2 -0.943386 -0.093176 -1.012187
3 -0.791908 -0.901481 -1.584894